[
  "You couldn’t score in a shootout against a garbage can.",
  "Nice bucket — did your mom pick it out?",
  "You skate like you're wearing ski boots.",
  "I've seen better hands on a digital clock.",
  "Your shot has less power than my grandma's blender.",
  "You're softer than warm butter.",
  "You're a healthy scratch waiting to happen.",
  "Nice pass — to the other team.",
  "Go back to house league.",
  "You play like you paid for the ice time yourself.",
  "That celly? More embarrassing than your plus-minus.",
  "Your tape job makes me want to cry.",
  "Your flow looks like it got caught in a weed whacker.",
  "You’ve got more turnovers than a bakery.",
  "Did you learn that deke at public skate?",
  "Your slapshot is a love tap.",
  "You couldn’t hit water if you fell out of a boat.",
  "Your GAA is a national tragedy.",
  "You play defense like a traffic cone.",
  "Are you even trying?",
  "You're as useful as a broken stick.",
  "You couldn't finish a sandwich, let alone a play.",
  "Your stickhandling is tragic.",
  "Call the zamboni — you’re melting out here.",
  "Did your coach teach you that or YouTube?",
  "You're the reason we do bag skates.",
  "Even your shadow plays better D.",
  "You’ve got hands like feet.",
  "Do you need GPS to find the puck?",
  "You're a walking turnover.",
  "Bench warmer of the year.",
  "I’ve seen cardboard cutouts with more edgework.",
  "You're a pylon with opinions.",
  "You're slower than the third period nacho line.",
  "Even your chirps are weak.",
  "Nice dive — you trying out for Broadway?",
  "Your game is a highlight reel — for the other team.",
  "That backcheck was optional, huh?",
  "You belong in the penalty box — permanently.",
  "You're the only guy who could miss an open net twice.",
  "You'd miss a pass in a phone booth.",
  "Your celly has more energy than your shift.",
  "Your stick is straighter than your skating.",
  "Can’t wait to see you on waivers.",
  "Nice try, minor leaguer.",
  "Even the coach is chirping you.",
  "Put the puck down — it's scared.",
  "Your last hit was a hug.",
  "Your passes come with a 'return to sender' label.",
  "You skate like you’re allergic to speed.",
  "Your shot is the cure for insomnia.",
  "You should wear a cone instead of a helmet.",
  "More ice time won’t fix that.",
  "You're like a traffic circle — everyone just goes around you.",
  "Where’s your skill? Left it in the locker room?",
  "Your stick tape job looks like a crime scene.",
  "Stop playing like your skates are tied together.",
  "You lose more faceoffs than a mirror.",
  "Your celly is the only highlight you’ve got.",
  "You make the boards look skilled.",
  "You couldn’t dangle a set of keys.",
  "You pass like your eyes are closed.",
  "Is your stick made of rubber?",
  "You're the reason they invented the red line.",
  "Even the ref pities your game.",
  "You're a zero on the plus-minus and in life.",
  "That save? More like a suggestion.",
  "Your game IQ is room temperature.",
  "That chirp was as weak as your wrister.",
  "You're not even good at water bottle flipping.",
  "You're the poster child for icing.",
  "Nice hands — for a bricklayer.",
  "You’ve been on the ice for 20 minutes and done nothing.",
  "You couldn’t sauce a pass on a pizza.",
  "Did your stick just break or was that your spirit?",
  "They should put you on the scoreboard as a giveaway.",
  "Your hustle is sponsored by slow motion.",
  "You screen your own goalie more than theirs.",
  "You’re the only one who thinks you’re good.",
  "You’re a ghost out here.",
  "Even your own team avoids passing to you.",
  "You’re the coach’s favorite — on the bench.",
  "You’re the reason we run out of sticks.",
  "I’ve seen pylons make better stops.",
  "Your jersey has more puck marks than stats.",
  "You could miss the ocean from the beach.",
  "You have less chemistry than a science dropout.",
  "Your idea of backchecking is turning around slowly.",
  "You’ve got less finish than a raw steak.",
  "You're not even good at chirping.",
  "The puck’s avoiding you on purpose.",
  "Even your chirps need coaching.",
  "You’re a walking minus.",
  "You couldn’t crack a beer let alone the lineup.",
  "Every time you shoot, an angel cries.",
  "You're on thin ice — and still can’t move.",
  "Your gloves have more touch than your hands.",
  "You're the mascot now, bud."
]
